[
    [
        "Center Stage: Magnolia Steele Mystery #1",
        [
            77.33880341880341,
            "Wow, another great series from Denise Grover Swank!!  I didn't think I could love another of Denise's characters as much as I love Rose Gardner, but I think Magnolia Steele is sitting right there next to Rose.  First of all, EVERY SINGLE book that Denise has written captures my attention and my heart from the very first pages.  Center Stage is no different, your heart goes out to Magnolia as she is dealing with both her recent humiliation in New York City and the fear she feels from the events that happened 10 years ago, events that she can't remember but knows they were terrifying and caused her to leave Franklin, TN the very next day.  The action kicks up rather quickly as a murder occurs, and of course Magnolia is in the wrong place at the wrong time and becomes the lead suspect. She takes it upon herself, along with some new friends and family, to investigate the crime and clear her name. Along the way, she finds herself in some awkward, scary, and surprising situations.Being home brings back more memories of the terrifying experience that caused her to leave 10 years ago, and some anonymous communications warning Magnolia to essentially keep it buried leave you at the edge of your seat to find out what happened on that fateful night.Seeing and interacting with people from her past leaves you feeling the guilt, sadness, and even anger that Magnolia is experiencing.  I really enjoyed the fact that the new people that come into her circle give her a sense of happiness, belonging, and even possible romance.While the murders seem to be resolved by the end of this installment, I am not so sure that's the end of it.  There is certainly many things left to explore, especially the characters and what happened since she left, potential love interests, the mystery of the fateful night all those years ago, and I almost forgot her DAD...I am so excited to see how these things play out and what adventures Magnolia is sure to get in as the series evolves.  I am already impatiently waiting for the next book!!",
            "My mother used to call this kind of book popcorn for the brain..  It's a good book for when you just want a great read and nothing to intense.  IT was just what I was looking for",
            "I love almost all of Dennise Grover Swank's series.  They are charming adventures full of unexpected twists and turns.  Hope you enjoy too!",
            "Rugged at my heart even though it is a mystery?  Golden girl or not, no one should have that much misery.",
            "Interesting plot and characters.  Looking forward to the next installment."
        ]
    ],
    [
        "4 Nicholas Colt Novels",
        [
            74.51272727272728,
            "I put Jude Hardin's work in the same class as Lee Child and John Sandford, in other words very good. the first three stories (Crosscut, Snuff tag 9, Key Death) were 5 stars, the last one just too unbelievable,",
            "Nicholas Colt is one of those characters that you are drawn to and once you start reading these stories you won't want to stop. Great storylines, well written and believable. I throughly enjoyed reading this set and look forward to more by this author.",
            "I enjoyed the series very much.  I gravitate to series as one good book leaves me wanting more of the same.",
            "Great introduction to a wonderful characterI intend to get my hands on as many as possible!",
            "Good read."
        ]
    ],
    [
        "The Gray and Guilty Sea: An Oregon Coast Mystery (Garrison Gage Series Book 1)",
        [
            74.08616593567251,
            "It is an engaging story of a retired PI forced of his own accord into investigating the death of a runaway.",
            "Very well written whodunit which describes the setting very well and keeps you guessing till the end. Really loved reading this.",
            "An interesting detective, with definite drawbacks that create reader empathy, struggling to recover from a devastating loss, the nightmare of any investigator ... his wife is killed, the intended target having been himself.He fights the demons of insecurity, loss, and physical disability. He is unsure about letting in people into his life but finds family anyway.Sheer stubborn grit helps him solve a murder. There's an element of serendipity about the ending, but the book grips you most of the time and is never a drag. Definitely worth a read, surely worth reading the next in the series!",
            "I was particularly intrigued by the novel because it is set in Oregon and having read it I can appreciate the way Carter depicts the place and the people.",
            "If you like anti-heroes ..you'll like this book.  Retains the surprise element almost till the end..",
            "A good read, with a surprising denouement.",
            "Not so great book. Can read for timepass",
            "Nice and intriguing book.."
        ]
    ],
    [
        "The Nostradamus Equation (Sam Reilly Book 6)",
        [
            72.08878621378622,
            "A good read...filled with adventure and unexpected twists and turns that were truly surprising. The reappearance of Billie offers the opportunity for the tale to continue...but I'd worry about Tom and Genevieve.",
            "An excellent and exciting read.  The storyline reminds me of the way Clive Cussler runs an adventure with a little history to start and then plunges into some insane excitement.",
            "An engrossing story with more turns tone worked through!  Chracter development is excellent.  Similar to Dirk Pitt books.  Pure adventure.",
            "Great twists and turns for edge of your seat action. Great use of connecting previous books with the current one. Excellent read.",
            "I enjoyed this book. I look forward to reading other books by this author."
        ]
    ],
    [
        "BONE BABY: chilling emotional suspense with a killer ending",
        [
            71.94446680080482,
            "It was hard to put down. It was a somewhat sad story (not depressing) with some interesting twists and turns for Lily to help resolve some issues with secrets from her and Terry's past.",
            "I couldn't stop reading! Great book!",
            "Bone Baby is a gripping story about horrifying secrets and unforgivable crimes.Lily and her partner lived with a terrible secret. While Charlotte Mary pushed her feelings away, Lily felt the weight of the truth every day. Neither of them spoke about it. When Charlotte Mary dies, Lily finally decides to make things right.Having always lived in the shadow of her partner, Lily finds a new freedom in trying to rectify the mistake of her youth. But as she delves deeper in her search for answers, her actions will have consequences she could never have imagined.Dickson's writing is engaging with authentic dialogue. The characters' actions have unexpected results and you're always guessing about what will happen next. Lily really carries the novel - it's from her perspective that the storyline unfolds - so it's fortunate that Dickson has created such a relatable, if unexpected, heroine. Lily is an ordinary person in extraordinary circumstances. She is driven by wanting to do the right thing, but Dickson's plot has her weaving through moral grey areas and ultimately Lily must face doing the unthinkable.You're unable to stop wondering: what would I have done?",
            "An unusual story but a riveting read. The main character is an older woman who carries a secret with her that begins to obsess her. She wants to find out the truth about something that happened to her, but ends up getting in deep water.",
            "Superb and scary thriller. All the characters are believable, especially Lily, and the web of lies in the family makes for an interesting drama. Great read."
        ]
    ],
    [
        "The Complete Sherlock Holmes: All 56 Stories & 4 Novels (Global Classics)",
        [
            69.71981646825397,
            "I am not going to write about the book, we all know this book is awesome.I'll talk about the manufacture of the book, which is pretty bad, in my opinion.The cover illustration, i can deal with.The paper quality and print, sub par.First book has glassy cover, second one is matte. I don't know what gives!! Check the photo I added. Either make both glossy or both matte.I didn't return it cause I was really busy those weeks and didn't have the time, otherwise I definitely would have.",
            "Doyle's language Is amazing. \"what one can invent another can discover\",where else we cab find such things. It wld be better had you watched the tv series earlier. The font size is readable.",
            "The detective novel itself cannot be questioned on any front. But, the paper quality is below standard and grayish in colour. The binding is quite good and overall boxset looks goods.",
            "This is so good a read. Doyle always had an intriguing way to write. You'll admire the book once you've read it. Very classic.",
            "Very fine, must buy, do not hesitate. Amazon is the best for this book.",
            "Nice book, always a fan of Sherlock so bought this set. But quality can be a little better for the book. Fonts are small and pages too, cannot read while travelling.",
            "SherlockHolmes is the single best mystery story ever written! Sherlock is just immaculate. It's a must read for any mystery and thriller book lovers! The novels are great and the short stories are gripping! It won't let you down!",
            "Very good stories for a beginner of detective genre. Short length of the stores makes them easy to complete in one sitting. Covers a wide variety of crimes and can be used by any wannabe detectives to learn the art of sleuths"
        ]
    ],
    [
        "Steady Trouble (Steady Teddy Book 1)",
        [
            69.49815594089337,
            "If you like mindless action and violence, you may like this story, though over half the book is spent on Teddy's introspection as she ponders things in her mind, so it may be too dull for the violence lovers.  I gave it 2 Stars for effort since I didn't notice any flagrant typos or grammar errors, and there was one line I especially liked where Teddy was trying to decide if she could trust one of the guys after he helped her:\"All of these things have the arrow pointing up on Gordo. However, like I do with everyone, I'll put him on a series of one-day contracts. Those contracts are constantly up for review.\"  It's an interesting way to look at life and relationships.Unfortunately, the story itself was too unbelievable and unrealistic for me to finish and I finally stopped at 84%. There were just too many places where the story defied logic.  The bad guys seemed to always attack Teddy in twos and threes rather than in a big bunch, so she can kill them off easier. They catch her in a restaurant but only sit down with her in an intimidating way rather than shoot her outright, and only make their move when the owner tells them to leave.  Then they shoot the owner in cold blood, in front of witnesses no less, giving Teddy time to get her own gun out and shoot them before they can finish her off.  If they wanted her dead, why didn't the just shoot her right off?In every encounter Teddy gets injured but it doesn't affect her in the next scene.  For example, in the first attack she is head butted in the face, feeling her sinus cavities smashed and filling with blood, yet in the next chapter, as she drives away in her eye-catching red porsche, she makes no mention of it bothering her. Actually, Teddy's body takes tremendous abuse that would likely kill anyone else, yet she's able to fight off trained professional killers and keep making wise cracks (..many of which were actually amusing).The story also suffers from the old cowboy \"white hat\" syndrome.  Teddy, who is a novice shooter and didn't even know she needed to load the gun in her first encounter, was able to shoot and hit every bad guy, usually on the first shot, even after suffering grievous injuries, while the hired trained killers always miss her.  They kill everyone around Teddy with a single shot, but they can't hit Teddy.The police are none existent in the story, other than sirens in the distance.  With that many public shootings I'm pretty sure the cops would be a little more alert and on the ball, and would no doubt do some investigating.  So far, that hasn't happened.I feel the author has good writing skills and with changes I think the author could make this a much more realistic and enjoyable story.  As it's written right now, I can't recommend it.",
            "This is a very fast-paced interesting read.  I won't share any information on what happens in the story because I don't care for it when other people do it.  I will say that this book had me interested from the start and I read it cover to cover in just one sitting - while ignoring my life around me.  Great job telling this fabulous story.",
            "Steady Teddy, an amnesiac survivor of the home invasion that killed her parents, is a mid-level professional criminal. She does a little pimping, runs a good card game and manages a bar. She is not unhappy with her life, but of course that won't last...A very bizarre  man comes into her life with a strange proposal that may enrich her...if it doesn't kill her... According to this bizarre \"Gordon\", her previous life (what little she can remember) was a lie...and if she just signs up for a deal in NYC, she could be set for life...details to be added later. Thus begins one of the darkest comedies (and one of the funniest) that I have ever read!HIGHLY RECOMMENDED",
            "Teddy is a very interesting character, very likable, very funny, and quite adaptable. She takes crap from nobody!! After making a life altering decision she has to take a stand to keep her life. Along the way she runs into many characters that aren't happy with her still breathing. It's an exciting , action packed book with a surprise twist for an ending!!!",
            "Talk about a walk on the wild side, this is a perfect example.  Non stop action, suspense ,and drama.  A must red for action junkies."
        ]
    ],
    [
        "Forever is a Lie",
        [
            69.10698936480188,
            "My birthday was already ruined by Rains....but like a ritual...I every year gift myself smthg...This time I  gifted myself one of my favourite author's book -  \"Forever is a lie\" by none other than Novoneel Chakraborty... Those who know me ...they know me I am his dedicated fan since last 9 years.... but a silent one... 💘💘💘❤❤❤Okay yesterday was indeed a long day ...followed by a sleepless night....  my constant urge was to read the book..Finally I picked it up at 5 a.m. and it got over at 8 a.m.....  Hope this says how Gripping the book was... trust me the thrill he gives with every book of his ... it really runs a chill down my spine...Even aftr 9 years.. I still have the same question-  \" Where do u create this mystery from??? And whr do u get ur words from???\"So so so so Thrilling..  Trust me u would chuck ur routine life for 3 hours till u put the book down... The characters . . I am in love with the male fictional character \"Saveer\"... the book has left me speechless  like his every other book...For me it's a 5 star rating in  every way and I believe Sequel is bound to be there....All the best and awaiting the sequel sir...",
            "I am your biggest fan Novoneel....have no idea when will i get to meet you...your books are one of the best thing happen to me..i never thought i could finish any book in 2 hours...but you words are magic...keep it up and cant wait for Forever is a truth...pls publish it as soon as possible :)",
            "When i bought this book i was sure what i am picking up. It was one of the best thrillers I've read till now. It ended on a note of suspense. Waiting for it's second part.",
            "Just can't express it in words how amazing dis first #forever series is!! Superb story line n hypnotising character-sketch! Loved every bit of it,every sound of d words even..N now holding d breath on to go through d second fabulous part whenever it's out to reach d hearts.All love n respect for you dear author.You r just #WOW!!",
            "Excellent book.Once again Novoneel rocks and struks the plot in the mid way.Waiting for part 2.",
            "Another book with a unique plot by my favourite author...and as usual i loved it...it literally gave me goosebumps..specially the ending...nd srsly i was not able to put this book down before reaching the end...bt now i am double excited for it's final part...",
            "IAM big fan of novoneel trillers starting from his first book to dis forever s a lie ...dis book gave me goosebumps 😍😍novoneel always make his readers to wait for his 2nd part and dats wat he exactly did ....",
            "One of the finest writing read post black suits you (from Novoneel).as book said every thing said kills magic no words to describe the magical world Novoneel gets reader into.....waiting for continuing part...."
        ]
    ],
    [
        "Origin – Read a Free Sample Now (Robert Langdon)",
        [
            68.90826569264068,
            "Though the book will be released on 3rd Oct,  the preview itself is gripping.. And Dan brown is a master of the quest books,  this time the fusion of modern architecture and past will surely be  a classic combination. I wish to start reading it on my newly purchased KINDLE PAPER WHITE. ALSO I AM GETTING A HARD COPY TO READ AGAIN FOR A BOOK FEEL...",
            "Can't wait for the book to get released. This is going to be another rocking masterpiece of Dan Brown. Let's hope for the best.",
            "Should be good dose of Dan Brown. Hoping for a bigger and better plot than The Inferno which was quite a miss as far as I found it. GG",
            "It’s beautiful...tempting and charming at the same time !!! Can’t wait to get my copy !! Robert Langdon and his adventures through history is just mesmerising.",
            "It's quite promising,  with more surprises and a n intense reading required.Its profound narrative is quite challenging and at the same time quite intimidating.",
            "Been looking forward to the moment of reading the greatest book by the greatest writer of the century.Dan Brown I am your greatest fan, I wanna meet you.",
            "Word are good here. Bondings of teacher and student remind me of mine. I was waiting for this book and can't let it go like others.",
            "They have all one thing in common. They are all dead wrong!Its gonna be an awesome read! Can't wait to get my copy! Welcome back Robert Langdon."
        ]
    ],
    [
        "Cause to Run (An Avery Black Mystery—Book 2)",
        [
            68.23791486291486,
            "I finished this book in one weekend and that's all I did those two days. It has everything I love in a thriller, that is the thrill apart, it has a scary killer, drama in the lead's life, precision of geography and the chance to learn something new about a subject, which in this case is Astrology.It is easy to jump behind Avery Black and take the ride because she is convincing that way. The show of heroine's super-strength and super-detection felt slightly overdone, but hey Conan Doyle got away with the same, so why blame authors now. But that apart Black is an endearing lead. This was the first book in the series I read and am looking forward to reading the rest.",
            "I am really enjoying this series.  Avery is a top notch investigator although lately she's been accused of putting work before everything and everyone, including her daughter and her partner.  As she works to solve her latest case she also has to deal with her personal life.",
            "Love the characters and the story lines! Blake Pierce is one of my new favorite authors! Just bought the third book in the series and can't wait to read it and the rest!",
            "It was virtually impossible to put the book down.  Avery Black  is a powerful character but a very human with many forces pulling at her from all sides.  Being a detective , a mother to her college  . Age daughter, and a partner in a relationship is a daunting role. Her up and down trials make for a fast moving read that kept me from putting the book down.A",
            "Why did the serial killer, Edwin Pesh, in book one become Edwin Peet in book two? Was there no proofreading",
            "Love a good mystery book. This is one. The story line keeps you wanting to continue the book and find the answers. Great read"
        ]
    ],
    [
        "The Sialkot Saga",
        [
            66.43733766233765,
            "One of the best books I have read so far, a very well researched novel, encompassing all the major events in history, bringing tragedies and mysteries together. Long Live Ashwin Sanghi. You are the Dan Brown and Paulo Coelho of the East.. This one's a masterpiece💜💜⚜🔱📖Everybody must read it, let knowledge enlighten you.",
            "I loved the book because the sequential events of history were strategically interwined with the 2 key persons of the book.Also, stories from Pre-independence era was touch based for climax of the story.Loved the conceptualisation of how urge for monetary achievements was dramatically mixed with twisting events of life.It helped to learn many commercial ideas that is achievable in anyones life from the lead characters.Definitely 5star for me!!!",
            "Very Very Interesting Book. Each and Every page of the book keeps you guessing what is going to happen next. \"Arvind Bagdia\" character of the book, I liked it most, How he does various scams without getting into any kind of legal trouble and making tones of money was excellently written. Climax of the book was amazing. Can't Miss Book if you like to read thrillers",
            "Great product, as usual Amazon amazed me, by delivering a say before.Sialkot Saga is a great book, I mean it keeps you up and engaged every moment. Ashwin has done a very great research, in putting plots and history on Tracks. I would recommend strongly some one who is into real plots and induce themselves with a bit Nostalgia.",
            "It touching...almost the reality of lives were bought in front. Nicely poised and balanced. touching and with history and modern age...perfect balance.",
            "It's an okay okay book.... Compared to The Krishna Key; The Rozabel Line and Chanakya's Chant, this book didn't match the same level, but I could see slight resemblance to Jefferey Archer's style...",
            "Reminded me of Hindi movie of 60s and 70s. Hindi movie story interwoven with facts of that era and twisted by some fantasy ...Why is he imitating western writers. thoroughly disappointing",
            "Best thing of this book is the way historical events since independence is covered. Recap of big financial fraud. There was two story completely different story going on and climax explain how both stories was linked. Though climax is very filmy and does not match with the quality of story but it still a very entertaining book."
        ]
    ],
    [
        "The Professor (McMurtrie and Drake Legal Thrillers Book 1)",
        [
            65.23465158045977,
            "As being huge fan of court drama I picked this book without second thought (of course , after reading reviews on good reads ) and It didn't disappoint me in any ways. Mr. Baily's first endeavour grips you from the first page and doesn't leave you until you hear final verdict from jury members. Writer knows how to tell a story and make it page turning even if you kind of know how will it end and you know who is the criminal here. This law thriller does have typical hateful villain , beautiful side kick assistant , hard working side-protagonist full of weaknesses and very intelligent but vulnerable main protagonist , this professor, but has a story with twists and turns. A definite read for law thriller lovers.",
            "For a debut novel, it is quite well-written. It is not surprising that the trial scenes appear quite realistic as the author is a defence lawyer himself.The protagonist, a 68 year old legend in the legal world, is forced into retirement from his teaching job. He then teams up with a former student to work on a case that involves the death of multiple people by a speeding truck. The emotional struggle between the characters resonates with realism.The story involves an example of how big companies with money and muscle power try to get away with crimes they commit. The scenes are well-paced, and there are elements of suspense throughout the book.This is the first book in a series. One of my favourite characters in The Professor, Bocephus Haynes plays the leading role in the second book, and I am sure to read it soon.",
            "The book concentrates largely on establishing the character of the professor and his legend (obviously as a prelude to what might be a series of books). A mostly linear narrative and low on drama, the novel is quite a decent read for people who like courtroom dramas. Though for a courtroom drama, it is quite low on dramatic twists.",
            "The book was nice and couldn't keep it down specially the professors entry and the fight back. Got it at killer price of 9 Rs/-. A must read for everyone.",
            "I was quite caught up with title that followed spending a whole night to read this book . And at last  i want to say to all the readers ' dude , go for it . U will not regret '.",
            "You get hold of the story after about 20% and it is a nice read and in someways inspiring especially the musso part in the end. A fighter is always a fighter.",
            "Nice read . Quite captivating. Thrilling through out. Difficult to put down. Story grew beautifully to a superb climax. Great work.",
            "Racy legal thriller .... difficult to put down. Creditable for a first book. Look forward to the next one ..."
        ]
    ],
    [
        "Origin: Number 5 of the Robert Langdon Series",
        [
            63.162186379928315,
            "Dan brown did his research on this one, throws deadends and false clues at the reader to hide the greater truth building up in the background. Following his usual formula of [SPOILER] having the most trusted person (or entity) as the villain (apparent one in this case)[SPOILER ENDS], he also continous his quest to turn these novels into textbooks for art courses, offhandedly mentions Elon Musk and also embodies the apprehensions he has with in the rather mind-blowing climax in the last five chapters. A musk read for the religious, atheist and future AI overlords.",
            "It is almost like going back to The Da Vinci Code, but with more in depth than I could have imagined. The author really know how to keep one on his/her toes.Also, I don't quite understand why the Spanish king needs to be included in this, if not just for the suspense.I enjoyed the technology and the reasoning with the religion. May be we really may see this to be true by 2050.",
            "Dan brown,as always,have written this book very well......Robert Langdon's character in this book is bind blowing........ thriller and breathtaking story with lots of suspense.......I would recommend all book reading lovers to read this book and especially to dan Brown's fans...... Amazon u r really good at delivering orders at right time.......I appreciate ur punctuality",
            "Dan Brown at his brilliant best. Loved what I’ve read so far. Can’t wait to finish it and write a more detailed review. Also, thank you amazon for delivering the book right on the day of release!",
            "The book released internationally on 29th September. Having the book on 4th Oct. Kudos Amazon for on time delivery. Received hard cover for a good deal of discount. Hoping to finish it asap.Digitally signed copies as promised.",
            "Got a book with a damaged spine. Still gave it 5 stars because I'm rating the book and not Amazon's shipping. Just amazing.Dan's just went ahead and outdone himself. Excellent job, net letting us down.",
            "Dan Brown's novels create a sensation while reading. An extraordinary novel featuring Robert Langdon ORIGIN. Everyone should give it a read.Thank you Amazon for delivering it.",
            "So far whatever I have read it is slow pace in comparison to other books of the author too much of extra descriptions which makes it lengthy and somewhat boring."
        ]
    ],
    [
        "The Text",
        [
            57.187872023809526,
            "this book had a very genuine ending not that interesting........i thought that it would have an unexpected ending as it started intrestingly but it had an very very expected ending",
            "The Text is a free Kindle short by British author, Claire Douglas. Emily Latimer is incensed when she sends a text to her boyfriend about her boss, Andrew. In her anger, she makes a critical spelling error and picks the wrong recipient. But when Andrew turns up dead the next morning, that text message causes her problems. A very short story (25 pages) with a few twists and populated with a few nasty types. The last 15 pages are an extract of  Last Seen Alive. Average.",
            "Enjoyed reading this book, and are looking forward to reading more from Claire",
            "Light reading."
        ]
    ],
    [
        "The Adventures of Sherlock Holmes",
        [
            53.554612016908216,
            "Great Book...",
            "VERY NICE PRODUCT",
            "If you love Sherlock Holmes, you will love these BBC Books, which are around 200-300 pages, and written in medium fonts. Most Sherlock Holmes collections are fat books, written in minuscule fonts, which make them unsuitable if you want to gift to your teenage child. The very volume and font size would put them off. This one does a good job on those two areas.And about Sherlock Holmes books itself - what more needs to be said?",
            "paper quality was poor",
            "Its OK",
            "Paper quality is very bad and no pics in it",
            "Everybody knows him -- the pipe-smoking detective on Baker Street (with or without the movie-added deerstalker), who is able to deduce all sorts of things just by glancing at a person. \"The Adventures of Sherlock Holmes\" shows off Sir Arthur Conan Doyle's first collection of short stories involving Holmes, mingling human psychology with sometimes bizarre mysteries.Holmes is visited by the masked King of Bohemia, who has a slight problem: he's engaged to a princess, but his former lover Irene Adler has a compromising letter that could jeopardize his future marriage. But Adler has a formidable brain of her own. Then Holmes is hired by a man who was hired by the mysterious Red-Headed League, and given a strange job... which is somehow connected to a criminal undertaking.Among the other strange cases that Holmes and Watson undertake -- a missing fiance, a strange murder in Boscombe Valley, a dead man who was sent five orange seeds, a woman whose husband has utterly vanished, a blue jewel hidden in a Christmas turkey, a dead woman whose last words were \"it was the band, the speckled band!\", a young engineer given a dream job, an American heiress who vanishes directly after her wedding, a broken beryl coronet, and a young woman given a surreally weird job.Sherlock Holmes mysteries come in two types:1. The case is completely baffling, and Holmes is needed to unravel the knot of obscure clues.2. The case seems straightforward, but Holmes is needed to connect seemingly unrelated clues to the crime in order to find the REAL perpetrator.There are plenty of both kinds in \"The Adventures of Sherlock Holmes,\" with a dozen cases that require Holmes' unique detecting skills -- it can be something as simple as locating a letter, or something as complex as foiling a robbery or counterfeiting ring. Doyle's stately, dignified prose is heightened by moments of excitement or horror (\" It swelled up louder and louder, a hoarse yell of pain and fear and anger all mingled in the one dreadful shriek\"), and he wove in a lot of human psychology into Holmes' cases.Holmes himself... is Holmes. Doyle didn't like his detective much, but Sherlock's knife-edged intellect and fascination with puzzles are strangely hypnotic -- even if you wouldn't like to be roomies with the guy, it would be amazing just to sit and watch him work. Watson is the perfect counterpoint for Holmes: he's not a genius but is definitely intelligent, warm-hearted and capable.\"The Adventures of Sherlock Holmes\" is a magnificent collection of Holmes' first twelve short cases, filled with murder, intrigue and all sorts of weird crimes. An absolute must-read.",
            "Worth reading it.Amazon provided and delivered  quality book as per its words..."
        ]
    ],
    [
        "BRITISH MYSTERIES Ultimate Collection: 560+ Detective Novels, Thriller Classics, Murder Mysteries, Whodunit Tales & True Crime Stories (Illustrated Edition): ... Cases, Max Carrados Stories and many more",
        [
            -1
        ]
    ]
]